Repository: CozmoNate/Clover-Utilities
Catalog: CloverPrefPane/*.lproj/Localizable.strings
Languages: ru

source: Boot Volume
ru: Загрузочный диск

source: Choose EFI folder
ru: Выберите папку EFI

source: Clover on %@
ru: Clover на %@

source: Clover updates check completed
ru: Проверка обновлений завершена

source: Default
ru: По умолчанию

source: EFI on %@ (%@)
ru: EFI на %1$@ (%2$@)

source: No
ru: Нет

source: No description available
ru: Нет описания

source: No new Clover revisions are avaliable at this time!
ru: Пока нет новых версий, доступных для загрузки!

source: None
ru: Нет

source: Not specified
ru: Не указано

source: Save Clover setting
ru: Сохранить настройки Clover

source: Set custom Clover location
ru: Укажите папку с Clover

source: Download...
ru: Обновить...

source: Updates
ru: Обновления

source: Current booted revision:
ru: Текущая версия загрузчика:

source: Last installed revision:
ru: Последняя установленная версия:

source: Latest available revision:
ru: Доступные обновления:

source: checking...
ru: идет проверка...

source: Checking...
ru: Идет проверка...

source: Theme
ru: Тема

source: Selected theme preview
ru: Предпросмотр выбранной темы

source: Select bootloader GUI theme
ru: Выберите тему для загрузчика

source: Never
ru: Никогда

source: Hourly
ru: Каждый час

source: Daily
ru: Каждый день

source: Weekly
ru: Раз в неделю

source: Monthly
ru: Раз в месяц

source: Check for updates:
ru: Проверять обновления:

source: Last updates check was
ru: Последняя проверка

source: Check now
ru: Проверить сейчас

source: Author:
ru: Автор:

source: Year:
ru: Год:

source: Kernel boot arguments:
ru: Аргументы ядра при загрузке:

source: Create timestamp CloverEFI/boot.log file on every boot
ru: Создавать каждый раз новый файл CloverEFI/boot.log

source: Select bootloader location
ru: Выберите расположение Clover

source: Save bootloader settings...
ru: Сохранить настройки загрузчика...

source: Saves config.plist of bootloader that currently booted the system
ru: Сохраняет config.plist загрузчика, который загрузил систему

source: Select OEM configuration
ru: Выберите конфигурацию OEM

source: Edit config.plist
ru: Изменить config.plist

source: Reveal in Finder
ru: Показать в Finder

source: Set EFI folder
ru: Выбрать папку EFI

source: Force create EFI folder backups on destination volume
ru: Создавать копии папки EFI загрузчика на системном томе

source: Number of EFI folder backups to keep
ru: Максимальное количество копий папки EFI

source: Maximum timestamp log files allowed
ru: Максимальное количество файлов boot.log

source: Number of previous boot log lines to save
ru: Лимит сообщений с прошлых загрузок

source: Selected theme information
ru: Инофрмация по выбранной теме

source: Copyright © 2013 JrCs, kozlek. All rights reserved.
ru: Copyright © 2013 JrCs, kozlek. Все права защищены.

source: NOTE: Selected theme will be used only if it was previously installed with Clover. If selected theme is unavailable, default theme will be used instead.
ru: ПРИМЕЧАНИЕ: Выбранная тема будет доступна только если она была установлена вместе с Clover. Если выбранная тема недоступна, то будет использована встроенная тема.

source: EFI folder backups will be created on destination volume rather then ESP, while updating bootloader
ru: Копии папки EFI, при инсталяции новых версий загрузчика, будут создаваться на выбранном томе, а не в корне ESP (Если загрузчик устанавливается на ESP)

source: Mounting the ESP partition on boot Value: * No: result in not mounting ESP partition on boot * Boot Volume: mount the ESP on the same disk drive as the system partition * User defined ESP: mount specified ESP on sytem startup
ru: Монтирует EFI раздел при загрузке системы Значения: * Нет: не производить ни каких действий с разделами EFI * Загрузочный диск: монтировать EFI раздел, находящийся на диске с загружаемой системой * На выбор пользователя: монтировать выбранный раздел при старте системы

source: Force mount selected ESP at startup
ru: Монтировать раздел EFI на старте системы

source: Save the nvram contents to disk (NVRAM emulation) Value: * No: don't save the nvram contents to disk * Default: save the nvram contents in the nvram.plist file in the root folder of the system partition or on one of the helper partioions
ru: Сохраняет содержимое NVRAM на диск (эмуляция NVRAM) Значение: * Нет: не сохранять содержимое NVRAM на диск * По умолчанию: сохраняет файл nvram.plist в корне диска с системой или на специализированных системных разделах

source: Store NVRAM contents on system boot partition
ru: Сохранять содержимое NVRAM на системном диске
